app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 99.9], ["updated_at", "2023-05-08 05:28:18.023164"], ["id", 9]]
---
    def update
        @product = Product.find(params[:id])

        respond_to do |format|
            if @product.update(p_params)

INSERT INTO "products" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "lalala"], ["price", nil], ["created_at", "2023-05-08 05:09:59.488899"], ["updated_at", "2023-05-08 05:09:59.488899"]]
---
    def save
        @product = Product.new(p_params)

        respond_to do |format|
            if @product.save